In [221]:
import pandas as pd 
import numpy as np

Columns renaming

In [222]:
data = pd.read_csv('./data/mammals.csv')
data.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [223]:
#Fast and for all
data.columns = ['name', 'weight_body_kg', 'weight_brain_kg']
data.head()

              name  weight_body_kg  weight_brain_kg
0       Arctic fox           3.385             44.5
1       Owl monkey           0.480             15.5
2  Mountain beaver           1.350              8.1
3              Cow         465.000            423.0
4        Grey wolf          36.330            119.5

In [224]:
#For choosen columns
columns = {'weight_body_kg': 'weight_bodyKG', 'weight_brain_kg': 'weight_brainKG'}
data.rename(columns = columns, inplace=True)
data.head()

              name  weight_bodyKG  weight_brainKG
0       Arctic fox          3.385            44.5
1       Owl monkey          0.480            15.5
2  Mountain beaver          1.350             8.1
3              Cow        465.000           423.0
4        Grey wolf         36.330           119.5

In [225]:
data = pd.read_csv('./data/mammals.csv', index_col='name')
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

In [226]:
#Chagne the value in index
data.rename(index= {'Cow': 'Land Cow'}, inplace=True)
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [227]:
#Using a copy to change a value inside of dataframe. Use .loc
dataCopy = data.copy()
dataCopy.loc['Arctic fox', 'body'] = 5
dataCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5

In [228]:
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [229]:
#Example
profession = pd.read_csv('./data/Prestige.csv', index_col='name')
profession.head()

                     education  income  women  prestige  census  type
name
gov.administrators       13.11   12351  11.16      68.8    1113  prof
general.managers         12.26   25879   4.02      69.1    1130  prof
accountants              12.77    9271  15.70      63.4    1171  prof
purchasing.officers      11.42    8865   9.11      56.8    1175  prof
chemists                 14.62    8403  11.68      73.5    2111  prof

In [230]:
professionCopy = profession.copy()
professionCopy

                     education  income  women  prestige  census  type
name
gov.administrators       13.11   12351  11.16      68.8    1113  prof
general.managers         12.26   25879   4.02      69.1    1130  prof
accountants              12.77    9271  15.70      63.4    1171  prof
purchasing.officers      11.42    8865   9.11      56.8    1175  prof
chemists                 14.62    8403  11.68      73.5    2111  prof
...                        ...     ...    ...       ...     ...   ...
bus.drivers               7.58    5562   9.47      35.9    9171    bc
taxi.drivers              7.93    4224   3.59      25.1    9173    bc
longshoremen              8.37    4753   0.00      26.1    9313    bc
typesetters              10.00    6462  13.58      42.2    9511    bc
bookbinders               8.55    3617  70.87      35.2    9517    bc

[102 rows x 6 columns]

In [231]:
columns = {'women': 'womenPercent', 'prestige': 'prestigeIndicator'}
professionCopy.rename(columns=columns, inplace=True)
professionCopy.head()

,education,income,womenPercent,prestigeIndicator,census,type
name,,,,,,
gov.administrators,13.11,12351,11.16,68.8,1113,prof
general.managers,12.26,25879,4.02,69.1,1130,prof
accountants,12.77,9271,15.70,63.4,1171,prof
purchasing.officers,11.42,8865,9.11,56.8,1175,prof
chemists,14.62,8403,11.68,73.5,2111,prof

In [232]:
professionCopy.rename(index={'accountants': 'bookkeepers', 'general.managers': 'managers'}, inplace=True)
professionCopy.head()

,education,income,womenPercent,prestigeIndicator,census,type
name,,,,,,
gov.administrators,13.11,12351,11.16,68.8,1113,prof
managers,12.26,25879,4.02,69.1,1130,prof
bookkeepers,12.77,9271,15.70,63.4,1171,prof
purchasing.officers,11.42,8865,9.11,56.8,1175,prof
chemists,14.62,8403,11.68,73.5,2111,prof

Data Modification
data.loc[index, column] = newValue

In [233]:
data = pd.read_csv('./data/insurance.csv')
data.head()

   ID  District   Group    Age  Holders  Claims
0   1         1     <1l    <25      197      38
1   2         1     <1l  25-29      264      35
2   3         1     <1l  30-35      246      20
3   4         1     <1l    >35     1680     156
4   5         1  1-1.5l    <25      284      63

In [234]:
#Direct change of data
data.loc[2, 'Claims'] = 19
data.head()

   ID  District   Group    Age  Holders  Claims
0   1         1     <1l    <25      197      38
1   2         1     <1l  25-29      264      35
2   3         1     <1l  30-35      246      19
3   4         1     <1l    >35     1680     156
4   5         1  1-1.5l    <25      284      63

In [235]:
#Direct filktering to get a specific condition
isYounger = data['Age'] == '<25'
data.where(isYounger).dropna()

      ID  District   Group  Age  Holders  Claims
0    1.0       1.0     <1l  <25    197.0    38.0
4    5.0       1.0  1-1.5l  <25    284.0    63.0
8    9.0       1.0  1.5-2l  <25    133.0    19.0
12  13.0       1.0     >2l  <25     24.0     4.0
16  17.0       2.0     <1l  <25     85.0    22.0
20  21.0       2.0  1-1.5l  <25    149.0    25.0
24  25.0       2.0  1.5-2l  <25     66.0    14.0
28  29.0       2.0     >2l  <25      9.0     4.0
32  33.0       3.0     <1l  <25     35.0     5.0
36  37.0       3.0  1-1.5l  <25     53.0    10.0
40  41.0       3.0  1.5-2l  <25     24.0     8.0
44  45.0       3.0     >2l  <25      7.0     3.0
48  49.0       4.0     <1l  <25     20.0     2.0
52  53.0       4.0  1-1.5l  <25     31.0     7.0
56  57.0       4.0  1.5-2l  <25     18.0     5.0
60  61.0       4.0     >2l  <25      3.0     0.0

In [236]:
data.loc[isYounger, 'Holders'].head()

0     197
4     284
8     133
12     24
16     85
Name: Holders, dtype: int64

In [237]:
#Adding 100 to the specific value with condition
data.loc[isYounger, 'Holders'] = data.loc[isYounger, 'Holders'] + 100
data.head()

   ID  District   Group    Age  Holders  Claims
0   1         1     <1l    <25      297      38
1   2         1     <1l  25-29      264      35
2   3         1     <1l  30-35      246      19
3   4         1     <1l    >35     1680     156
4   5         1  1-1.5l    <25      384      63

In [238]:
#Challange
profession.loc['chemists','type'] = 'scientist'
profession.head()

                     education  income  women  prestige  census       type
name
gov.administrators       13.11   12351  11.16      68.8    1113       prof
general.managers         12.26   25879   4.02      69.1    1130       prof
accountants              12.77    9271  15.70      63.4    1171       prof
purchasing.officers      11.42    8865   9.11      56.8    1175       prof
chemists                 14.62    8403  11.68      73.5    2111  scientist

In [239]:
isScientist = (profession['type'] == 'scientist')
isScientist.head()

name
gov.administrators     False
general.managers       False
accountants            False
purchasing.officers    False
chemists                True
Name: type, dtype: bool

In [240]:
#Change all value in prestige columns for scientist to 90
profession.loc[isScientist, 'prestige'] = 90
profession.head()

                     education  income  women  prestige  census       type
name
gov.administrators       13.11   12351  11.16      68.8    1113       prof
general.managers         12.26   25879   4.02      69.1    1130       prof
accountants              12.77    9271  15.70      63.4    1171       prof
purchasing.officers      11.42    8865   9.11      56.8    1175       prof
chemists                 14.62    8403  11.68      90.0    2111  scientist

In [241]:
#Multiply inome by 1.5 for scientists
profession.loc[isScientist, 'income'] = profession['income'] * 1.5
profession

/var/folders/yk/fs7s5htj44b8ds6qh_c6gb0m0000gn/T/ipykernel_88718/2143217163.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[12604.5]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  profession.loc[isScientist, 'income'] = profession['income'] * 1.5

                     education   income  women  prestige  census       type
name
gov.administrators       13.11  12351.0  11.16      68.8    1113       prof
general.managers         12.26  25879.0   4.02      69.1    1130       prof
accountants              12.77   9271.0  15.70      63.4    1171       prof
purchasing.officers      11.42   8865.0   9.11      56.8    1175       prof
chemists                 14.62  12604.5  11.68      90.0    2111  scientist
...                        ...      ...    ...       ...     ...        ...
bus.drivers               7.58   5562.0   9.47      35.9    9171         bc
taxi.drivers              7.93   4224.0   3.59      25.1    9173         bc
longshoremen              8.37   4753.0   0.00      26.1    9313         bc
typesetters              10.00   6462.0  13.58      42.2    9511         bc
bookbinders               8.55   3617.0  70.87      35.2    9517         bc

[102 rows x 6 columns]

Adding and deleting rows or columns

In [242]:
data = pd.read_csv('./data/sleep_time.csv')
data

,ID,name,genus,vore,order,conservation,sleep_total,sleep_rem,sleep_cycle,awake,brainwt,bodywt
0,1,Cheetah,Acinonyx,carni,Carnivora,lc,12.1,NaN,NaN,11.9,NaN,50.000
1,2,Owl monkey,Aotus,omni,Primates,NaN,17.0,1.8,NaN,7.0,0.01550,0.480
2,3,Mountain beaver,Aplodontia,herbi,Rodentia,nt,14.4,2.4,NaN,9.6,NaN,1.350
3,4,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9,2.3,0.133333,9.1,0.00029,0.019
4,5,Cow,Bos,herbi,Artiodactyla,domesticated,4.0,0.7,0.666667,20.0,0.42300,600.000
...,...,...,...,...,...,...,...,...,...,...,...,...
78,79,Tree shrew,Tupaia,omni,Scandentia,NaN,8.9,2.6,0.233333,15.1,0.00250,0.104
79,80,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2,NaN,NaN,18.8,NaN,173.330
80,81,Genet,Genetta,carni,Carnivora,NaN,6.3,1.3,NaN,17.7,0.01750,2.000
81,82,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5,NaN,NaN,11.5,0.04450,3.380
82,83,Red fox,Vulpes,carni,Carnivora,NaN,9.8,2.4,0.350000,14.2,0.05040,4.230

In [243]:
#Delete columns
data.drop(columns='awake', inplace=True)
data

,ID,name,genus,vore,order,conservation,sleep_total,sleep_rem,sleep_cycle,brainwt,bodywt
0,1,Cheetah,Acinonyx,carni,Carnivora,lc,12.1,NaN,NaN,NaN,50.000
1,2,Owl monkey,Aotus,omni,Primates,NaN,17.0,1.8,NaN,0.01550,0.480
2,3,Mountain beaver,Aplodontia,herbi,Rodentia,nt,14.4,2.4,NaN,NaN,1.350
3,4,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9,2.3,0.133333,0.00029,0.019
4,5,Cow,Bos,herbi,Artiodactyla,domesticated,4.0,0.7,0.666667,0.42300,600.000
...,...,...,...,...,...,...,...,...,...,...,...
78,79,Tree shrew,Tupaia,omni,Scandentia,NaN,8.9,2.6,0.233333,0.00250,0.104
79,80,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2,NaN,NaN,NaN,173.330
80,81,Genet,Genetta,carni,Carnivora,NaN,6.3,1.3,NaN,0.01750,2.000
81,82,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5,NaN,NaN,0.04450,3.380
82,83,Red fox,Vulpes,carni,Carnivora,NaN,9.8,2.4,0.350000,0.05040,4.230

In [244]:
#Delete rows, labels = index
data.drop(axis=0, labels= [1,2], inplace=True)
data

,ID,name,genus,vore,order,conservation,sleep_total,sleep_rem,sleep_cycle,brainwt,bodywt
0,1,Cheetah,Acinonyx,carni,Carnivora,lc,12.1,NaN,NaN,NaN,50.000
3,4,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9,2.3,0.133333,0.00029,0.019
4,5,Cow,Bos,herbi,Artiodactyla,domesticated,4.0,0.7,0.666667,0.42300,600.000
5,6,Three-toed sloth,Bradypus,herbi,Pilosa,NaN,14.4,2.2,0.766667,NaN,3.850
6,7,Northern fur seal,Callorhinus,carni,Carnivora,vu,8.7,1.4,0.383333,NaN,20.490
...,...,...,...,...,...,...,...,...,...,...,...
78,79,Tree shrew,Tupaia,omni,Scandentia,NaN,8.9,2.6,0.233333,0.00250,0.104
79,80,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2,NaN,NaN,NaN,173.330
80,81,Genet,Genetta,carni,Carnivora,NaN,6.3,1.3,NaN,0.01750,2.000
81,82,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5,NaN,NaN,0.04450,3.380
82,83,Red fox,Vulpes,carni,Carnivora,NaN,9.8,2.4,0.350000,0.05040,4.230

In [245]:
#Axis = 0, always
data.drop(labels=[4], inplace=True)
data

,ID,name,genus,vore,order,conservation,sleep_total,sleep_rem,sleep_cycle,brainwt,bodywt
0,1,Cheetah,Acinonyx,carni,Carnivora,lc,12.1,NaN,NaN,NaN,50.000
3,4,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9,2.3,0.133333,0.00029,0.019
5,6,Three-toed sloth,Bradypus,herbi,Pilosa,NaN,14.4,2.2,0.766667,NaN,3.850
6,7,Northern fur seal,Callorhinus,carni,Carnivora,vu,8.7,1.4,0.383333,NaN,20.490
7,8,Vesper mouse,Calomys,NaN,Rodentia,NaN,7.0,NaN,NaN,NaN,0.045
...,...,...,...,...,...,...,...,...,...,...,...
78,79,Tree shrew,Tupaia,omni,Scandentia,NaN,8.9,2.6,0.233333,0.00250,0.104
79,80,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2,NaN,NaN,NaN,173.330
80,81,Genet,Genetta,carni,Carnivora,NaN,6.3,1.3,NaN,0.01750,2.000
81,82,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5,NaN,NaN,0.04450,3.380
82,83,Red fox,Vulpes,carni,Carnivora,NaN,9.8,2.4,0.350000,0.05040,4.230

In [246]:
#The easiet and fastest version, axis is alwasy set to 0 and labels in second in documentation
data.drop(5, inplace=True)
data

,ID,name,genus,vore,order,conservation,sleep_total,sleep_rem,sleep_cycle,brainwt,bodywt
0,1,Cheetah,Acinonyx,carni,Carnivora,lc,12.1,NaN,NaN,NaN,50.000
3,4,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9,2.3,0.133333,0.00029,0.019
6,7,Northern fur seal,Callorhinus,carni,Carnivora,vu,8.7,1.4,0.383333,NaN,20.490
7,8,Vesper mouse,Calomys,NaN,Rodentia,NaN,7.0,NaN,NaN,NaN,0.045
8,9,Dog,Canis,carni,Carnivora,domesticated,10.1,2.9,0.333333,0.07000,14.000
...,...,...,...,...,...,...,...,...,...,...,...
78,79,Tree shrew,Tupaia,omni,Scandentia,NaN,8.9,2.6,0.233333,0.00250,0.104
79,80,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2,NaN,NaN,NaN,173.330
80,81,Genet,Genetta,carni,Carnivora,NaN,6.3,1.3,NaN,0.01750,2.000
81,82,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5,NaN,NaN,0.04450,3.380
82,83,Red fox,Vulpes,carni,Carnivora,NaN,9.8,2.4,0.350000,0.05040,4.230

CONCAT

In [247]:
#Drop columns for less code and just example for concat
data.drop(columns=['sleep_rem', 'sleep_cycle', 'brainwt', 'bodywt'], axis=1, inplace=True)

In [248]:
#Rememebr to add name of var before pd.concat to add a rows
new_data = {
    'name': ['Panda4'], 
    'genus': [np.NaN], 
    'vore': [np.NaN], 
    'order': [np.NaN], 
    'conservation': [np.NaN], 
    'sleep_total': [10]
}
data = pd.concat([data, pd.DataFrame(new_data)], ignore_index=True)
data

,ID,name,genus,vore,order,conservation,sleep_total
0,1.0,Cheetah,Acinonyx,carni,Carnivora,lc,12.1
1,4.0,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9
2,7.0,Northern fur seal,Callorhinus,carni,Carnivora,vu,8.7
3,8.0,Vesper mouse,Calomys,NaN,Rodentia,NaN,7.0
4,9.0,Dog,Canis,carni,Carnivora,domesticated,10.1
...,...,...,...,...,...,...,...
75,80.0,Bottle-nosed dolphin,Tursiops,carni,Cetacea,NaN,5.2
76,81.0,Genet,Genetta,carni,Carnivora,NaN,6.3
77,82.0,Arctic fox,Vulpes,carni,Carnivora,NaN,12.5
78,83.0,Red fox,Vulpes,carni,Carnivora,NaN,9.8
79,NaN,Panda4,NaN,NaN,NaN,NaN,10.0

In [249]:
(data['name'] == 'Panda4').value_counts()

name
False    79
True      1
Name: count, dtype: int64

In [250]:
#Take some part of dataframe and add it by using concat
subset = data[:20]
data = pd.concat([data, subset], ignore_index=True)
data

,ID,name,genus,vore,order,conservation,sleep_total
0,1.0,Cheetah,Acinonyx,carni,Carnivora,lc,12.1
1,4.0,Greater short-tailed shrew,Blarina,omni,Soricomorpha,lc,14.9
2,7.0,Northern fur seal,Callorhinus,carni,Carnivora,vu,8.7
3,8.0,Vesper mouse,Calomys,NaN,Rodentia,NaN,7.0
4,9.0,Dog,Canis,carni,Carnivora,domesticated,10.1
...,...,...,...,...,...,...,...
95,20.0,North American Opossum,Didelphis,omni,Didelphimorphia,lc,18.0
96,21.0,Asian elephant,Elephas,herbi,Proboscidea,en,3.9
97,22.0,Big brown bat,Eptesicus,insecti,Chiroptera,lc,19.7
98,23.0,Horse,Equus,herbi,Perissodactyla,domesticated,2.9
99,24.0,Donkey,Equus,herbi,Perissodactyla,domesticated,3.1

In [251]:
#Excersises
profession = pd.read_csv('./data/Prestige.csv')
profession

                    name  education  income  women  prestige  census  type
0     gov.administrators      13.11   12351  11.16      68.8    1113  prof
1       general.managers      12.26   25879   4.02      69.1    1130  prof
2            accountants      12.77    9271  15.70      63.4    1171  prof
3    purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4               chemists      14.62    8403  11.68      73.5    2111  prof
..                   ...        ...     ...    ...       ...     ...   ...
97           bus.drivers       7.58    5562   9.47      35.9    9171    bc
98          taxi.drivers       7.93    4224   3.59      25.1    9173    bc
99          longshoremen       8.37    4753   0.00      26.1    9313    bc
100          typesetters      10.00    6462  13.58      42.2    9511    bc
101          bookbinders       8.55    3617  70.87      35.2    9517    bc

[102 rows x 7 columns]

In [252]:
dict = {'name': ['data scientist'], 'education': [np.NaN], 'income': [np.NaN], 'women': [np.NaN], 'prestige': [np.NaN], 'census': [np.NaN], 'type': [np.NaN]}
profession = pd.concat([profession, pd.DataFrame(dict)], ignore_index=True)
profession.tail()

               name  education  income  women  prestige  census type
98     taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc
99     longshoremen       8.37  4753.0   0.00      26.1  9313.0   bc
100     typesetters      10.00  6462.0  13.58      42.2  9511.0   bc
101     bookbinders       8.55  3617.0  70.87      35.2  9517.0   bc
102  data scientist        NaN     NaN    NaN       NaN     NaN  NaN

In [253]:
taxi = profession[profession['name'] == 'taxi.drivers']
taxi

            name  education  income  women  prestige  census type
98  taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc

In [254]:
#Drop choosen row
profession.drop(98, inplace=True)

In [255]:
#Add a row
profession = pd.concat([profession, taxi], ignore_index=True)
profession.tail()

               name  education  income  women  prestige  census type
98     longshoremen       8.37  4753.0   0.00      26.1  9313.0   bc
99      typesetters      10.00  6462.0  13.58      42.2  9511.0   bc
100     bookbinders       8.55  3617.0  70.87      35.2  9517.0   bc
101  data scientist        NaN     NaN    NaN       NaN     NaN  NaN
102    taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc

In [257]:
#Del census columns
profession.drop('census', axis=1, inplace=True)
profession

                    name  education   income  women  prestige  type
0     gov.administrators      13.11  12351.0  11.16      68.8  prof
1       general.managers      12.26  25879.0   4.02      69.1  prof
2            accountants      12.77   9271.0  15.70      63.4  prof
3    purchasing.officers      11.42   8865.0   9.11      56.8  prof
4               chemists      14.62   8403.0  11.68      73.5  prof
..                   ...        ...      ...    ...       ...   ...
98          longshoremen       8.37   4753.0   0.00      26.1    bc
99           typesetters      10.00   6462.0  13.58      42.2    bc
100          bookbinders       8.55   3617.0  70.87      35.2    bc
101       data scientist        NaN      NaN    NaN       NaN   NaN
102         taxi.drivers       7.93   4224.0   3.59      25.1    bc

[103 rows x 6 columns]

In [258]:
#Del type column
del profession ['type']
profession

                    name  education   income  women  prestige
0     gov.administrators      13.11  12351.0  11.16      68.8
1       general.managers      12.26  25879.0   4.02      69.1
2            accountants      12.77   9271.0  15.70      63.4
3    purchasing.officers      11.42   8865.0   9.11      56.8
4               chemists      14.62   8403.0  11.68      73.5
..                   ...        ...      ...    ...       ...
98          longshoremen       8.37   4753.0   0.00      26.1
99           typesetters      10.00   6462.0  13.58      42.2
100          bookbinders       8.55   3617.0  70.87      35.2
101       data scientist        NaN      NaN    NaN       NaN
102         taxi.drivers       7.93   4224.0   3.59      25.1

[103 rows x 5 columns]

Index operations

In [259]:
data = pd.read_csv('./data/mammals.csv')
data.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [263]:
data.set_index('name', inplace=True)
data

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5
...                  ...    ...
Brazilian tapir  160.000  169.0
Tenrec             0.900    2.6
Phalanger          1.620   11.4
Tree shrew         0.104    2.5
Red fox            4.235   50.4

[62 rows x 2 columns]

In [264]:
data.reset_index()

               name     body  brain
0        Arctic fox    3.385   44.5
1        Owl monkey    0.480   15.5
2   Mountain beaver    1.350    8.1
3               Cow  465.000  423.0
4         Grey wolf   36.330  119.5
..              ...      ...    ...
57  Brazilian tapir  160.000  169.0
58           Tenrec    0.900    2.6
59        Phalanger    1.620   11.4
60       Tree shrew    0.104    2.5
61          Red fox    4.235   50.4

[62 rows x 3 columns]

In [268]:
#SORT INDEX BECASUE IT WILL MAKE IT ESAIER TO SORT VALUES. IN THIS CASE IT WILL STOP WHEN IT HITS LETTER D
data.sort_index(ascending=True)
data.loc['Cow']

body     465.0
brain    423.0
Name: Cow, dtype: float64

In [270]:
data[:'Cat']

                               body    brain
name
Arctic fox                    3.385    44.50
Owl monkey                    0.480    15.50
Mountain beaver               1.350     8.10
Cow                         465.000   423.00
Grey wolf                    36.330   119.50
Goat                         27.660   115.00
Roe deer                     14.830    98.20
Guinea pig                    1.040     5.50
Verbet                        4.190    58.00
Chinchilla                    0.425     6.40
Ground squirrel               0.101     4.00
Arctic ground squirrel        0.920     5.70
African giant pouched rat     1.000     6.60
Lesser short-tailed shrew     0.005     0.14
Star-nosed mole               0.060     1.00
Nine-banded armadillo         3.500    10.80
Tree hyrax                    2.000    12.30
N.A. opossum                  1.700     6.30
Asian elephant             2547.000  4603.00
Big brown bat                 0.023     0.30
Donkey                      187.100   419.00
Horse                       521.000   655.00
European hedgehog             0.785     3.50
Patas monkey                 10.000   115.00
Cat                           3.300    25.60

In [271]:
data['Horse':'Cat']

                      body  brain
name
Horse              521.000  655.0
European hedgehog    0.785    3.5
Patas monkey        10.000  115.0
Cat                  3.300   25.6

Text columns

In [273]:
data = pd.read_csv('./data/PublicTransitExpenses.csv', usecols=['Agency', 'Reporter Type', 'Total Operating Expenses'])
data

,Agency,Reporter Type,Total Operating Expenses
0,Washington County Commissioners,Reduced Reporter,$122524.00
1,Washington County Commissioners,Reduced Reporter,$272715.00
2,"Texoma Area Paratransit System, Inc",Full Reporter,$7295.00
3,Kalispel Tribe of Indians,Reduced Reporter,$37416.00
4,Kalispel Tribe of Indians,Reduced Reporter,$345789.00
...,...,...,...
17839,Cedar Area Transportation Service,Rural Reporter,$53200.00
17840,Tehama County,Rural Reporter,$39446.00
17841,City of Dixon,Rural Reporter,$700405.00
17842,Morongo Basin Transit Authority,Rural Reporter,$570713.00
17843,City of Arvin,Rural Reporter,$50873.00

In [275]:
data['Agency'].str.contains('washington').value_counts()

Agency
False    17844
Name: count, dtype: int64

In [276]:
#Python is case sensetive, make it lower or upper.
data['Agency'] = data['Agency'].str.lower()
data['Agency'].str.contains('washington').value_counts()

Agency
False    17707
True       137
Name: count, dtype: int64

In [279]:
endswithferries = data['Agency'].str.lower().str.strip().str.endswith('ferries')
data[endswithferries]

                        Agency  Reporter Type Total Operating Expenses
199   washington state ferries  Full Reporter             $16215777.00
213   washington state ferries  Full Reporter             $11132493.00
364   washington state ferries  Full Reporter             $11750411.00
397   washington state ferries  Full Reporter             $22400732.00
604   washington state ferries  Full Reporter             $17715787.00
634   washington state ferries  Full Reporter            $236320045.00
653   washington state ferries  Full Reporter            $184425025.00
684   washington state ferries  Full Reporter            $186344635.00
915   washington state ferries  Full Reporter            $236711555.00
1114  washington state ferries  Full Reporter             $23046740.00

In [287]:
#Use functions to make it easier
def getComment(row):
    reporterType = row['Reporter Type']
    cost = float(row['Total Operating Expenses'].replace('$',''))
    
    if (cost > 200000):
        comment = "CLASS A"
    else:
        comment = "CLASS B"
    return (reporterType+'/'+comment)
data_over200K = data.apply(getComment, axis=1)
data_over200K.value_counts()

Full Reporter/CLASS A       9809
Full Reporter/CLASS B       3536
Rural Reporter/CLASS A      2118
Rural Reporter/CLASS B       998
Reduced Reporter/CLASS A     938
Reduced Reporter/CLASS B     375
Separate Service/CLASS B      42
Separate Service/CLASS A      28
Name: count, dtype: int64

In [288]:
data = pd.read_csv('./data/Fortune_500_2017.csv', usecols=['Rank', 'Title', 'Industry', 'Hqlocation', 'Sector'])
data.head()

,Rank,Title,Sector,Industry,Hqlocation
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR"
1,2,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE"
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA"
3,4,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX"
4,5,McKesson,Wholesalers,Wholesalers: Health Care,"San Francisco, CA"

In [290]:
#Sector to upper()
data['Sector'] = data['Sector'].str.upper()
data

,Rank,Title,Sector,Industry,Hqlocation
0,1,Walmart,RETAILING,General Merchandisers,"Bentonville, AR"
1,2,Berkshire Hathaway,FINANCIALS,Insurance: Property and Casualty (Stock),"Omaha, NE"
2,3,Apple,TECHNOLOGY,"Computers, Office Equipment","Cupertino, CA"
3,4,Exxon Mobil,ENERGY,Petroleum Refining,"Irving, TX"
4,5,McKesson,WHOLESALERS,Wholesalers: Health Care,"San Francisco, CA"
...,...,...,...,...,...
495,496,Michaels Cos.,RETAILING,Specialty Retailers: Other,"Irving, TX"
496,497,Toll Brothers,ENGINEERING & CONSTRUCTION,Homebuilders,"Horsham, PA"
497,498,Yahoo,TECHNOLOGY,Internet Services and Retailing,"Sunnyvale, CA"
498,499,Vistra Energy,ENERGY,Energy,"Dallas, TX"
499,500,ABM Industries,BUSINESS SERVICES,Diversified Outsourcing Services,"New York, NY"

In [296]:
comp = data['Industry'].str.strip().str.lower().str.contains('comp')
data[comp]

,Rank,Title,Sector,Industry,Hqlocation
2,3,Apple,TECHNOLOGY,"computers, office equipment","Cupertino, CA"
27,28,Microsoft,TECHNOLOGY,computer software,"Redmond, WA"
40,41,Dell Technologies,TECHNOLOGY,"computers, office equipment","Round Rock, TX"
46,47,Intel,TECHNOLOGY,semiconductors and other electronic components,"Santa Clara, CA"
60,61,HP,TECHNOLOGY,"computers, office equipment","Palo Alto, CA"
80,81,Oracle,TECHNOLOGY,computer software,"Redwood City, CA"
118,119,Qualcomm,TECHNOLOGY,semiconductors and other electronic components,"San Diego, CA"
151,152,Jabil Circuit,TECHNOLOGY,semiconductors and other electronic components,"St. Petersburg, FL"
161,162,Xerox,TECHNOLOGY,computer peripherals,"Norwalk, CT"
205,206,Texas Instruments,TECHNOLOGY,semiconductors and other electronic components,"Dallas, TX"
216,217,Western Digital,TECHNOLOGY,computer peripherals,"Irvine, CA"
225,226,Micron Technology,TECHNOLOGY,semiconductors and other electronic components,"Boise, ID"
264,265,Applied Materials,TECHNOLOGY,semiconductors and other electronic components,"Santa Clara, CA"
325,326,salesforce.com,TECHNOLOGY,computer software,"San Francisco, CA"
386,387,Nvidia,TECHNOLOGY,semiconductors and other electronic components,"Santa Clara, CA"
405,406,Activision Blizzard,TECHNOLOGY,computer software,"Santa Monica, CA"
408,409,NCR,TECHNOLOGY,"computers, office equipment","Duluth, GA"
413,414,Sanmina,TECHNOLOGY,semiconductors and other electronic components,"San Jose, CA"
439,440,Lam Research,TECHNOLOGY,semiconductors and other electronic components,"Fremont, CA"
442,443,Adobe Systems,TECHNOLOGY,computer software,"San Jose, CA"
464,465,Symantec,TECHNOLOGY,computer software,"Mountain View, CA"
467,468,NetApp,TECHNOLOGY,computer peripherals,"Sunnyvale, CA"

In [297]:
data[['City', 'Stale']] = data['Hqlocation'].str.split(",", expand=True)
data

,Rank,Title,Sector,Industry,Hqlocation,City,Stale
0,1,Walmart,RETAILING,general merchandisers,"Bentonville, AR",Bentonville,AR
1,2,Berkshire Hathaway,FINANCIALS,insurance: property and casualty (stock),"Omaha, NE",Omaha,NE
2,3,Apple,TECHNOLOGY,"computers, office equipment","Cupertino, CA",Cupertino,CA
3,4,Exxon Mobil,ENERGY,petroleum refining,"Irving, TX",Irving,TX
4,5,McKesson,WHOLESALERS,wholesalers: health care,"San Francisco, CA",San Francisco,CA
...,...,...,...,...,...,...,...
495,496,Michaels Cos.,RETAILING,specialty retailers: other,"Irving, TX",Irving,TX
496,497,Toll Brothers,ENGINEERING & CONSTRUCTION,homebuilders,"Horsham, PA",Horsham,PA
497,498,Yahoo,TECHNOLOGY,internet services and retailing,"Sunnyvale, CA",Sunnyvale,CA
498,499,Vistra Energy,ENERGY,energy,"Dallas, TX",Dallas,TX
499,500,ABM Industries,BUSINESS SERVICES,diversified outsourcing services,"New York, NY",New York,NY

In [300]:
def BuildShortcut(row):
    industry = row['Industry']
    result = " "
    for i in industry.split(" "):
        result += i[0]
    return result
BuildShortcut({'Industry': 'Factory Under Newspaper'})

' FUN'

In [301]:
data['IndustryShortcut'] = data.apply(BuildShortcut, axis=1)
data.head()

,Rank,Title,Sector,Industry,Hqlocation,City,Stale,IndustryShortcut
0,1,Walmart,RETAILING,general merchandisers,"Bentonville, AR",Bentonville,AR,gm
1,2,Berkshire Hathaway,FINANCIALS,insurance: property and casualty (stock),"Omaha, NE",Omaha,NE,ipac(
2,3,Apple,TECHNOLOGY,"computers, office equipment","Cupertino, CA",Cupertino,CA,coe
3,4,Exxon Mobil,ENERGY,petroleum refining,"Irving, TX",Irving,TX,pr
4,5,McKesson,WHOLESALERS,wholesalers: health care,"San Francisco, CA",San Francisco,CA,whc